#include<stdio.h>//选择法排序
int main()
{
    int i,j;
    int a[10]={65,45,32,13,67,98,75,42,18,23};  /*定义数组，存储用户输入的10个数*/
    int iTemp;  /*定义变量，表示最小的数组元素*/
    int iPos;  /*定义变量，表示元素位置*/
    /*使用选择法对数组元素从小到大排序*/
    for(i=0;i<9;i++)  /*设置外层循环下标为0~8，表示前9个数组元素*/
    {
        iTemp = a[i];  /*假设当前元素为最小值*/
        iPos = i;  /*记录最小元素位置*/
        for(j=i+1;j<10;j++)  /*设置内层循环下标为i+1~9，表示剩下的未排序数组元素部分*/
        {
            if(a[j]<iTemp)  /*如果后续的元素中有数比前面设定的最小值还小*/
            {
                iTemp = a[j];  /*重新设定最小值*/
                iPos = j;  /*修正最小元素位置*/
            }
        }
        a[iPos] = a[i];  /*此两行代码用于将最小的数组元素和当前排序次数对应的数组元素互换*/
        a[i] = iTemp;
    }
    printf("排序结果如下：\n");  /*输出数组*/
    for(i=0;i<10;i++)  /*输出数组*/
    {
        printf("%d\t",a[i]);  /*用制表位分隔数据*/
        if(i == 4)  /*如果是第5个元素*/
            printf("\n");  /*输出换行*/
    }
    printf("\n");  /*程序结束*/
    return 0;
}